CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/vegetation/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
/*   Windows 32 and 64 bit porting by blueCAPE: http://www.bluecape.com.pt   *\
|  Based on Windows porting (2.0.x v4) by Symscape: http://www.symscape.com   |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     0.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/vegetation/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


8
(
    left
    {
        type            mappedPatch;
        nFaces          154;
        startFace       193003;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     left;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    right
    {
        type            mappedPatch;
        nFaces          154;
        startFace       193157;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     right;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    back
    {
        type            mappedPatch;
        nFaces          98;
        startFace       193311;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     back;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    front
    {
        type            mappedPatch;
        nFaces          98;
        startFace       193409;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     front;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    bottom
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          3367;
        startFace       193507;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     bottom;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    top
    {
        type            mappedPatch;
        nFaces          308;
        startFace       196874;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     top;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    Building
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          7612;
        startFace       197182;
        sampleMode      nearestPatchFace;
        sampleRegion    air;
        samplePatch     Building;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

    air_to_vegetation
    {
        type            mappedWall;
        inGroups        List<word> 0();
        nFaces          1207;
        startFace       204794;
        sampleMode      nearestCell;
        sampleRegion    air;
        offsetMode      uniform;
        offset          ( 0 0 0 );
    }

)


// ************************************************************************* //
