CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/air/momentumTransport
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    turbulenceProperties;
}
simulationType    RAS;
RAS
{
  RASModel    realizableKE;
  turbulence    on;
  printCoeffs    on;
}
