CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/Building/transportProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    transportProperties;
}
buildingMaterials
(
  {
    name    Building;
    buildingMaterialModel    Hamstad5Brick;
    rho    1600;
    cap    1000;
    lambda1    0.682;
    lambda2    0;
  }
);
