CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/Idif
(
(    0   302   )
(    3600   383   )
(    7200   334   )
(    10800   273   )
(    14400   230   )
)
