CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/regionProperties
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  location    "constant";
  object    regionProperties;
}
regions
(
  fluid (air)
  vegetation (vegetation)
  solid (Building)
);
