CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/constant/sunPosVector
(
(    0   (-0.1692804089290923 0.1574030038228902 0.9729174875293025)   )
(    3600   (-0.17479401411234397 -0.08179139241310994 0.9812019265969765)   )
(    7200   (-0.1458386835853768 -0.31541384147473134 0.9376807489632265)   )
(    10800   (-0.08438710744857268 -0.5275482022576818 0.8453234353732014)   )
(    14400   (0.005374132111858864 -0.7037422673270534 0.710435035651693)   )
)
