CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/0/Building/ws
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "345600/leeward";
  object    ws;
}
dimensions    [1 -3 0 0 0 0 0];
internalField    uniform 2.5;
boundaryField
{
  buildings_to_air
  {
    type    zeroGradient;
  }
  interior
  {
    type    zeroGradient;
  }
  sides
  {
    type    zeroGradient;
  }
}
