CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/0/air/cloudCover
(
(    0   0.5   )
(    3600   0.8   )
(    7200   0.8   )
(    10800   0.5   )
(    14400   0.5   )
)
