CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/0/air/epsilon
FoamFile
{
  version    2.0;
  format    ascii;
  class    volScalarField;
  location    "0/air";
  object    epsilon;
}
dimensions    [0 2 -3 0 0 0 0];
internalField    uniform 0.1;
boundaryField
{
  left
  {
    type    slip;
  }
  right
  {
    type    slip;
  }
  top
  {
    type    slip;
  }
  bottom
  {
    type    epsilonWallFunction;
    Cmu    0.09;
    kappa    0.41;
    E    9.8;
    value    uniform 0.1;
  }
  back
  {
    type    zeroGradient;
  }
  front
  {
    type    turbulentMixingLengthDissipationRateInlet;
    mixingLength    10.0;
    value    uniform 0.001;
  }
  Building
  {
    type    epsilonWallFunction;
    Cmu    0.09;
    kappa    0.41;
    E    9.8;
    value    uniform 0.1;
  }
}
