CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/0/air/wambient
(
(    0   0.00911268794582036   )
(    3600   0.00911268794582036   )
(    7200   0.00911268794582036   )
(    10800   0.009129382908872373   )
(    14400   0.009129382908872373   )
)
