CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/system/Building/fvSchemes
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    fvSchemes;
}
ddtSchemes
{
  default    Euler;
}
gradSchemes
{
  default    Gauss linear;
}
divSchemes
{
  default    none;
}
laplacianSchemes
{
  default    none;
  laplacian(Krel,pc)    Gauss linear corrected;
}
interpolationSchemes
{
  default    linear;
}
snGradSchemes
{
  default    uncorrected;
}
fluxRequired
{
  default    no;
}
