CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/system/Building/fvSolution
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    fvSolution;
}
solvers
{
  pc
  {
    solver    PCG;
    preconditioner    DIC;
    tolerance    1e-10;
    relTol    0;
    minIter    1;
  }
  Ts
  {
    solver    PCG;
    preconditioner    DIC;
    tolerance    1e-10;
    relTol    0;
    minIter    1;
  }
}
