CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/system/Building/changeDictionaryDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    changeDictionaryDict;
}
boundary
{
  buildings_to_air
  {
    type    mappedWall;
    sampleMode    nearestPatchFace;
    sampleRegion    air;
    samplePatch    Building;
    offsetMode    uniform;
    offset    (0 0 0);
  }
}
