CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/system/air/topoSetDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    topoSetDict;
}
actions
(
  {
    name    vegetation;
    type    cellSet;
    action    new;
    source    surfaceToCell;
    sourceInfo
    {
      file    "constant/triSurface/vegetation.stl";
      outsidePoints    ((752.5543823242188 158.356201171875 83.9));
      includeCut    true;
      includeInside    true;
      includeOutside    false;
      nearDistance    -1;
      curvature    -100;
    }
  }
  {
    name    vegetation;
    type    cellZoneSet;
    action    new;
    source    setToCellZone;
    sourceInfo
    {
      set    vegetation;
    }
  }
);
