CR_Vegetation/26Nov2024_UMCF_CR-Vegfiles/CR_VS-UMCF_J-DOE08/system/meshQualityDict
FoamFile
{
  version    2.0;
  format    ascii;
  class    dictionary;
  object    meshQualityDict;
}
#includeEtc    "caseDicts/mesh/generation/meshQualityDict.cfg";
minTetQuality    -1e+30;
maxBoundarySkewness    4;
minTwist    -1e+30;
maxConcave    80;
maxInternalSkewness    4;
nSmoothScale    4;
errorReduction    0.75;
relaxed
{
  maxNonOrtho    75;
}
